@extends('layouts.app')

@section('content')

    @include('partial.sidebar')
    <div class="col-md-offset-3">
        <div class="container-fluid">

            <h3>Τρέχουσες προβλέψεις καιρού (DSM – point values)
            </h3>


            <p>Υπηρεσία διάθεσης προγνωστικών μετεωρολογικών προβλέψεων.</p>
            <p>Η υπηρεσία αναπτύχθηκε από το Τμήμα Μετεωρολογίας σε συνεργασία με το Ινστιτούτο Κύπρου και με αυτή διατίθενται σε μορφή ΤΧΤ, προβλέψεις καιρού με χρονικό ορίζοντα 5 ημερών. Οι προβλέψεις παράγονται με υψηλής ανάλυσης (2 χιλιόμετρα) μετεωρολογικό μοντέλο (WRF) που είναι πολύ πιο λεπτομερές από ότι άλλα συστήματα που μέχρι πρόσφατα χρησιμοποιούνταν στην Κύπρο και στην ευρύτερη περιοχή, μέσω της υποδομής του project CYTerra, τον ομώνυμο υπερυπολογιστή και τις διαδικτυακές υποδομές του Ινστιτούτου Κύπρου.</p>

            <p>Οι προβλέψεις ανανεώνονται 2 φορές την ημέρα. Τρέξιμο με δεδομένα 0000 Παγκόσμια Ώρα (διαθέσιμο συνήθως στις 0900 Τοπική Ώρα) και τρέξιμο με δεδομένα στις 1200 παγκόσμια ώρα (διαθέσιμο συνήθως στις 2100 τοπική) και περιλαμβάνουν τις πιο κάτω πληροφορίες καιρού:</p>

            <p>Οι ώρες πρόγνωσης αναφέρονται σε Παγκόσμια ώρα (UTC). H Τοπική ώρα = UTC +2 και για τις καλοκαιρινές ώρες UTC+3 (επιπλέον η θερινή ώρα).</p>

            <p>Για τις περιοχές αυτές τα ονόματα των σταθμών είναι της μορφής DSM_[AREA].txt, ενώ οι προβλέψεις που δίνονται είναι ωριαίες και αφορούν τις ακόλουθες παραμέτρους:</p>

            <ul>
                <li>(α) ημερομηνία και ώρα [Time]</li>
                <li>(β) θερμοκρασία [Temp] (Celsius)</li>
                <li>(γ) σχετική υγρασία [RH] (%)</li>
                <li>(δ) short wave radiation [SW] (watts / sq,meter)</li>
                <li>(ε) ταχύτητα ανέμου [V] (kt)</li>
                <li>(στ) δείκτης δυσφορίας [NET]</li>
            </ul>


            <p>Οι προβλέψεις που διατίθενται μέσω της υπηρεσίας αφορούν συνολικά 6 περιοχές:</p>
<ul>
            <li>ΑΘΑΛΑΣΣΑ</li>
            <li>ΚΑΡΒΟΥΝΑΣ(WIP)</li>
            <li>ΛΑΡΝΑΚΑ</li>
            <li>ΛΕΜΕΣΟΣ(WIP)</li>
            <li>ΠΑΦΟΣ(WIP)</li>
            <li>ΠΡΩΤΑΡΑΣ(WIP)</li>
</ul>
            <br>

            <p>Το σύστημα ανανεώνει τις πληροφορίες αυτόματα και δεν υπάρχει διάκριση στην ονοματολογία των σταθμών. Ως εκ τούτου ο μόνος τρόπος να καταλάβει κάποιος τι αρχείο βλέπει, είναι η ημερομηνία και ώρα της πρώτης προσφερόμενης τιμής.</p>

            <br>
            <pre>
                <a href="/api/weather/city/athalassa">API: http://82.196.12.250/api/weather/city/athalassa</a>
                <a href="/api/weather/city/larnaka">API: http://82.196.12.250/api/weather/city/larnaka</a>
            </pre>

        </div>
    </div>
    @endsection