@extends('layouts.app')

@section('content')

    @include('partial.sidebar')
    <div class="col-md-offset-3">
        <div class="container-fluid">

            <h3>Τρέχοντα προγνωστικά δεδομένων ανώτερης ατμόσφαιρας (RAOB)
            </h3>

            <p>Υπηρεσία διάθεσης προγνωστικών δεδομένων ανώτερης ατμόσφαιρας. Η υπηρεσία αναπτύχθηκε από το Τμήμα Μετεωρολογίας σε συνεργασία με το Ινστιτούτο Κύπρου και με αυτή διατίθενται, σε μορφή CSV και μορφοποίηση RAOB, προβλέψεις καιρού με χρονικό ορίζοντα 5 ημερών. Οι προβλέψεις παράγονται με υψηλής ανάλυσης (2 χιλιόμετρα) μετεωρολογικό μοντέλο (WRF) που είναι πολύ πιο λεπτομερές από ότι άλλα συστήματα που μέχρι πρόσφατα χρησιμοποιούνταν στην Κύπρο και στην ευρύτερη περιοχή, μέσω της υποδομής του project CYTerra, τον ομώνυμο υπερυπολογιστή και τις διαδικτυακές υποδομές του Ινστιτούτου Κύπρου.</p>

            <p>Περισσότερα για τον μορφότυπο RAOB CSV στον σύνδεσμο: http://www.raob.com/data_formats.php</p>

            <p>Οι προβλέψεις ανανεώνονται 2 φορές την ημέρα. Τρέξιμο με δεδομένα 0000 Παγκόσμια Ώρα (διαθέσιμο συνήθως στις 0900 Τοπική Ώρα) και τρέξιμο με δεδομένα στις 1200 παγκόσμια ώρα (διαθέσιμο συνήθως στις 2100 τοπική) και περιλαμβάνουν τις πιο κάτω πληροφορίες σε όλα τα βασικά ισοβαρικά επίπεδα:</p>

            <ul>
                <li>(α) Ισοβαρικό επίπεδο</li>
                <li>(β) Θερμοκρασία σε βαθμούς κελσίου</li>
                <li>(γ) Σημείο Δρόσου σε βαθμούς κελσίου</li>
                <li>(δ) Διεύθυνση άνεμου σε μοίρες</li>
                <li>(ε) Ταχύτητα άνεμου σε κόμβους</li>
                <li>(στ) Γεωδυναμικό ύψος σε γεωδυναμικά μέτρα</li>
            </ul>


            <p>Για κάθε μια από τις πιο κάτω περιοχές παρέχεται ξεχωριστό αρχείο με τις προβλέψεις ανά 3ωρο. Για κάθε περιοχή δηλαδή παρέχονται 40 συνολικά αρχεία που αντιστοιχούν σε προβλέψεις 5 ημερών. Οι προβλέψεις που διατίθενται μέσω της υπηρεσίας αφορούν συνολικά 6 περιοχές:</p>

            <ul>
                <li>ΠΕΡΙΟΧΗ</li>
                <li>ΑΘΑΛΑΣΣΑ</li>
                <li>ΛΑΡΝΑΚΑ</li>
                <li>ΠΑΦΟΣ</li>
                <li>ΠΑΡΑΛΙΜΝΙ</li>
                <li>ΠΟΛΙΣ</li>
                <li>ΠΡΟΔΡΟΜΟΣ</li>
            </ul>


            <p>Η ονομασία των αρχείων είναι η εξής: RAOB_CSV_[AREA]_[TIME].csv,</p>
            <p>όπου [AREA] η περιοχή και [TIME] η ώρα πρόγνωσης + Time x 3</p>

            <p>Οι ώρες πρόγνωσης αναφέρονται σε Παγκόσμια ώρα (UTC). H Τοπική ώρα = UTC +2 και για τις καλοκαιρινές ώρες UTC+3 (επιπλέον η θερινή ώρα)</p>

            <p>Το σύστημα ανανεώνει τις πληροφορίες αυτόματα και δεν υπάρχει διάκριση στην ονοματολογία των σταθμών. Ο μόνος τρόπος να καταλάβει κάποιος τι αρχείο βλέπει, είναι η ημερομηνία και ώρα της πρώτης προσφερόμενης τιμής.</p>


            <pre>
                <a href="/api/weather">API: http://82.196.12.250/api/weather</a>
            </pre>

        </div>
    </div>
    @endsection