<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class HomeController extends Controller
{
    /**
     * Create a new controller instance.
     *
     * @return void
     */
    public function __construct()
    {
//        $this->middleware('auth')->except(['index','details']);
    }

    /**
     * Show the application dashboard.
     *
     * @return \Illuminate\Http\Response
     */
    public function index()
    {
        return view('index');
    }
   


    public function environment($link = 2)
    {
        $result = [
                    [
                        'name'=>'Τρέχοντα προγνωστικά δεδομένων ανώτερης ατμόσφαιρας (RAOB)',
                        'text'=>'Υπηρεσία διάθεσης προγνωστικών δεδομένων ανώτερης ατμόσφαιρας. Η υπηρεσία αναπτύχθηκε από το Τμήμα Μετεωρολογίας σε συνεργασία με το Ινστιτούτο Κύπρου και με αυτή διατίθενται, σε μορφή CSV και μορφοποίηση RAOB, προβλέψεις καιρού με χρονικό ορίζοντα 5 ημερών. Οι προβλέψεις παράγονται με υψηλής ανάλυσης (2 χιλι... ',
                        'link'=>0
                    ],
                    [
                        'name'=>'Τρέχουσες προβλέψεις καιρού (DSM – point values)',
                        'text'=>'Υπηρεσία διάθεσης προγνωστικών μετεωρολογικών προβλέψεων. Η υπηρεσία αναπτύχθηκε από το Τμήμα Μετεωρολογίας σε συνεργασία με το Ινστιτούτο Κύπρου και με αυτή διατίθενται σε μορφή ΤΧΤ, προβλέψεις καιρού με χρονικό ορίζοντα 5 ημερών. Οι προβλέψεις παράγονται με υψηλής ανάλυσης (2 χιλιόμετρα) μετεωρολογικό μοντέ...',
                        'link' => 1
                    ],
                ];

        $result = collect($result);

        if ($link === "0")
        {
            return view('detail-env1');

        } elseif ($link === "1" )  {
            return view('detail-env0');
        }

        return view('environment')->with(['result'=>$result]);
    }

    public function environment1($link = 2)
    {
        $result = [
            [
                'city'=>'Τρέχουσες προβλέψεις καιρού (DSM – point values)',
                'api'=>'Υπηρεσία διάθεσης προγνωστικών μετεωρολογικών προβλέψεων.
Η υπηρεσία αναπτύχθηκε από το Τμήμα Μετεωρολογίας σε συνεργασία με το Ινστιτούτο Κύπρου και με αυτή διατίθενται σε μορφή ΤΧΤ, προβλέψεις καιρού με χρονικό ορίζοντα 5 ημερών. Οι προβλέψεις παράγονται με υψηλής ανάλυσης (2 χιλιόμετρα) μετεωρολογικό μοντέλο (WRF) που είναι πολύ πιο λεπτομερές από ότι άλλα συστήματα που μέχρι πρόσφατα χρησιμοποιούνταν στην Κύπρο και στην ευρύτερη περιοχή, μέσω της υποδομής του project CYTerra, τον ομώνυμο υπερυπολογιστή και τις διαδικτυακές υποδομές του Ινστιτούτου Κύπρου. ',
                'link'=>0
            ],

        ];

        if ($link == 0 ){
            return view('detail-env0')->with([]);
        } elseif ($link ==1) {
            return view('detail-env1')->with([]);
        }

        return view('environment1')->with(['result'=>$result]);
    }
    public function environment0()
    {
        $result = [
            [
                'city'=>'Τρέχοντα προγνωστικά δεδομένων ανώτερης ατμόσφαιρας (RAOB)',
                'api'=>'Υπηρεσία διάθεσης προγνωστικών δεδομένων ανώτερης ατμόσφαιρας. Η υπηρεσία αναπτύχθηκε από το Τμήμα Μετεωρολογίας σε συνεργασία με το Ινστιτούτο Κύπρου και με αυτή διατίθενται, σε μορφή CSV και μορφοποίηση RAOB, προβλέψεις καιρού με χρονικό ορίζοντα 5 ημερών. Οι προβλέψεις παράγονται με υψηλής ανάλυσης (2 χιλιόμετρα) μετεωρολογικό μοντέλο (WRF) που είναι πολύ πιο λεπτομερές από ότι άλλα συστήματα που μέχρι πρόσφατα χρησιμοποιούνταν στην Κύπρο και στην ευρύτερη περιοχή, μέσω της υποδομής του project CYTerra, τον ομώνυμο υπερυπολογιστή και τις διαδικτυακές υποδομές του Ινστιτούτου Κύπρου. ',
                'link'=>0
            ],

        ];


        return view('environment0')->with(['result'=>$result]);
    }

    public function weather()
    {
        return view('weather');
    }

}